fprintf('Температура насыщения (t2s), °С:  %.1f \n', t2s);
fprintf('Давление рабочего тела в ПГ (p2), бар:  %.2f \n', p2);
fprintf('Энтальпия питательной воды на входе в ПГ (hпв), кДж/кг:  %.2f \n', h_pv);
fprintf('Энтальпия продувочной воды (hпр = h''), кДж/кг:  %.2f \n', h_pr);
fprintf('Энтальпия сухого насыщенного пара при давлении рабочего тела p2 (h''''), кДж/кг:  %.2f \n', saturatedSteamEnthalpy);
fprintf('Энтальпия осушенного пара на выходе из ПГ (h2), кДж/кг:  %.2f \n', feedwaterEnthalpyOut);
fprintf('Удельный объём пара на выходе из ПГ (v2), м^3 /кг:  %.3f \n', feedwaterVolumeOut);
fprintf('Плотность пара на выходе из ПГ (ρ2), кг/м^3 :  %.2f \n', feedwaterDensityOut);
fprintf('Плотность питательной воды на входе в ПГ (ρпв), кг/м^3:  %.2f \n', feedwaterDensityIn);