fprintf('Температура насыщения теплоносителя (t1s), °С:  %.1f \n', t1s);
fprintf('Давление теплоносителя при температуре насыщения (p1), бар:  %.2f \n', p1);
fprintf('Средняя температура теплоносителя в трубках ПТО (t1_), °С:  %.1f \n', t1_);
fprintf('Средняя плотность теплоносителя в трубках ПТО (ρ1), кг/м^3:  %.2f \n', rho1);
fprintf('Коэффициент динамической вязкости теплоносителя (μ1), Па*с:  %.3e \n', mu1);
fprintf('Коэффициент кинематической вязкости теплоносителя (ν1), м^2/с:  %.3e \n', nu1);
fprintf('Средняя теплопроводность теплоносителя (λ1), Вт/(м*°C):  %.3f \n', lambda1);
fprintf('Изобарная теплоёмкость теплоносителя (cp1), кДж/(кг*°C):  %.2f \n', cp1);
fprintf('Число Прандтля для теплоносителя (Pr1):  %.3f \n', Pr1);