function a=steelTC(m, t)

eps0=0.01; %точность

dd0=[100 200 300 400 500];

% 22К
% 12МХ
% 15МХ
% 12Х1МФ
% 10ГН2МФА
% 08Х18Н10Т

switch m
    case "22К" % 22К
        aa0=[49.5 47.7 45.5 43.5 39.3];
    case "12МХ" % 12МХ
        aa0=[50.2 50.2 50.2 48.6 47];
    case "15МХ" % 15MX
        aa0=[44.5 41.3 40.8 39 36.1];
    case "12Х1МФ" % 12Х1МФ
        aa0=[41.3 40.8 40.3 39.7 39];
    case "10ГН2МФА" % 10ГН2МФА
        aa0=[36 40 43 44 NaN];
    case "08Х18Н10Т" % 08Х18Н10Т
        aa0=[16.3 17.5 18.8 21.4 23];
end

%интерполяция
dd1=linspace(100,500, 10001);
aa1=interp1(dd0, aa0, dd1, 'makima');

%поиск нужного значения
id = min(find(abs(dd1 - t) <= eps0));
a=aa1(id);
end

